Catalogs/ВСД_Город.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВСД_Город</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВСД_Регион</xr:Item>
				<xr:Item>Catalog.ВСД_Район</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВСД_Район.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВСД_Район</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВСД_Регион</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВетИС_API_АдресаСервер/Ext/Module.bsl
// GRACE:MODULE_START name="ВетИС_API_АдресаСервер"
// @grace-module: ВетИС_API_АдресаСервер
// @grace-purpose: Адресный классификатор: страны, регионы, районы, города, улицы
// @grace-depends: ВетИС_APIСервер, ВетИС_УтилитыКлиентСервер, ВетИС_ПараметрыСервер
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ВетИС_API_АдресаСервер"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_УтилитыКлиентСервер"
// GRACE:DEPENDENCY target="ВетИС_ПараметрыСервер"

Функция НайтиСтрануПоGUID(_GUID, name) Экспорт
	
	Ответ = Неопределено;
	_GUID = СокрЛП(_GUID);
	Если НЕ ПустаяСтрока(_GUID) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_Страна.Ссылка
		|ИЗ
		|	Справочник.ВСД_Страна КАК ВСД_Страна
		|ГДЕ
		|	ВСД_Страна.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", _GUID );
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_Страна [" + name + "] GUID [" + _GUID + "] добавлена");
			Спр = Справочники.ВСД_Страна.СоздатьЭлемент();
			Спр.Наименование = name;
			Спр.GUID = _GUID;
			Спр.Записать();
			Ответ = Спр.Ссылка;
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_Страна");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗагрузитьСтраны_ЗапросXML() Экспорт
	
	Запрос = "
	|<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' 
	|                  xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2' 
	|                  xmlns:base='http://api.vetrf.ru/schema/cdm/base'>
	|  <soapenv:Header/>
	|  <soapenv:Body>
	|    <ws:getAllCountryListRequest>
	|      <base:listOptions>
	|        <base:count>1000</base:count>
	|        <base:offset>0</base:offset>
	|      </base:listOptions>
	|    </ws:getAllCountryListRequest>
	|  </soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьСтраны_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Ответ = ИнициализацияХС_ЗагрузитьСтраны(Параметры);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры 

Функция ИнициализацияХС_ЗагрузитьСтраны( Параметры ) Экспорт
	
	ВетИС_APIСервер.ПометитьНаУдалениеСправочник("ВСД_Страна");
	
	ВетИС_APIСервер.СообщитьИнфо("Запрос GetAllCountryList ");
	ЗапросXML = ЗагрузитьСтраны_ЗапросXML();
	Service = "platform/services/2.1/IkarService";
	Action = "GetAllCountryList";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//НачатьТранзакцию();
	Попытка
		countryList = xdto.Body.getAllCountryListResponse.countryList.country;
		Для каждого country ИЗ countryList Цикл
			
			guid = country.guid;
			_uuid = country.uuid;
			name = country.name;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_Страна.Ссылка
			|ИЗ
			|	Справочник.ВСД_Страна КАК ВСД_Страна
			|ГДЕ
			|	ВСД_Страна.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", guid);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				Ответ = Результат.Ссылка;
				СпрОбъект = Ответ.ПолучитьОбъект();
				СпрОбъект.Наименование = name;
				СпрОбъект.GUID = guid;
				СпрОбъект.UUID = _UUID;
				СпрОбъект.Записать();
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Страна [" + name + "] GUID [" + guid + "] изменена", СпрОбъект.Ссылка);
				СпрОбъект.УстановитьПометкуУдаления(Ложь);
			Иначе
				
				СпрОбъект = Справочники.ВСД_Страна.СоздатьЭлемент();
				СпрОбъект.Наименование = name;
				СпрОбъект.GUID = guid;
				СпрОбъект.UUID = _UUID;
				СпрОбъект.Записать();
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Страна [" + name + "] GUID [" + guid + "] добавлена", СпрОбъект.Ссылка);
				Ответ = СпрОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
		//ЗафиксироватьТранзакцию();
		
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("Загрузка ВСД_Стран завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Страны'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Страны " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиРегионПоGUID(GUID, name, Страна) Экспорт
	
	Ответ = Неопределено;
	Guid = СокрЛП(Guid);
	Если НЕ ПустаяСтрока(Guid) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_Регион.Ссылка
		|ИЗ
		|	Справочник.ВСД_Регион КАК ВСД_Регион
		|ГДЕ
		|	ВСД_Регион.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_Регион [" + name + "] GUID [" + guid + "] добавлена");
			Спр = Справочники.ВСД_Регион.СоздатьЭлемент();
			Спр.Наименование = name;
			Спр.Владелец = Страна;
			Спр.GUID = guid;
			Спр.Записать();
			Ответ = Спр.Ссылка;
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_Регион");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗагрузитьРегионы_ЗапросXML( guid ) Экспорт
	
	Запрос = "<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2'
	|xmlns:base='http://api.vetrf.ru/schema/cdm/base'
	|xmlns:ikar='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ws:getRegionListByCountryRequest>
	|<base:listOptions>
	|<base:count>1000</base:count>
	|<base:offset>0</base:offset>
	|</base:listOptions>
	|<ikar:countryGuid>" + guid + "</ikar:countryGuid>
	|</ws:getRegionListByCountryRequest>
	|</soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьРегионы_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	_Страна = Параметры["Страна"];
	
	Ответ = ИнициализацияХС_ЗагрузитьРегионы(Параметры, _Страна);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры 

Функция ИнициализацияХС_ЗагрузитьРегионы(Знач Параметры, _Страна) Экспорт
	
	ВетИС_APIСервер.СообщитьИнфо("Запрос RegionListByCountry [" + СокрЛП(_Страна.GUID) + "]");
	ЗапросXML = ЗагрузитьРегионы_ЗапросXML(_Страна.GUID);
	Service = "platform/services/2.1/IkarService";
	Action = "RegionListByCountry";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, _Страна) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//НачатьТранзакцию();
	Попытка
		regionList = xdto.Body.getRegionListByCountryResponse.regionList.region;
		Для каждого region ИЗ regionList Цикл
			
			guid = region.guid;
			_uuid = region.uuid;
			name = region.view;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_Регион.Ссылка
			|ИЗ
			|	Справочник.ВСД_Регион КАК ВСД_Регион
			|ГДЕ
			|	ВСД_Регион.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", guid );
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда 
				Ответ = Результат.Ссылка;
				СпрОбъект = Ответ.ПолучитьОбъект();
				СпрОбъект.Владелец = _Страна;
				СпрОбъект.УстановитьПометкуУдаления(Ложь);
				СпрОбъект.Записать();
			Иначе
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Регион [" + name + "] GUID [" + guid + "] добавлена");
				Спр = Справочники.ВСД_Регион.СоздатьЭлемент();
				Спр.Наименование = name;
				Спр.GUID = guid;
				Спр.UUID = _UUID;
				Спр.Владелец = _Страна;
				Спр.Записать();
				Ответ = Спр.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		// ЗафиксироватьТранзакцию();
		
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("ВСД_Регион загрузка завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Регион'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Регион " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиГородПоGUID(GUID, name, Регион) Экспорт
	
	Ответ = Неопределено;
	Guid = СокрЛП(Guid);
	Если НЕ ПустаяСтрока(Guid) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_Город.Ссылка
		|ИЗ
		|	Справочник.ВСД_Город КАК ВСД_Город
		|ГДЕ
		|	ВСД_Город.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_Город [" + name + "] GUID [" + guid + "] добавлена");
			Спр = Справочники.ВСД_Город.СоздатьЭлемент();
			Спр.Наименование = name;
			Спр.GUID = guid;
			Спр.Владелец = Регион;
			Спр.Записать();
			Ответ = Спр.Ссылка;
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_Город");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗагрузитьГородаПоРегиону_ЗапросXML(guid) Экспорт
	
	Запрос = "<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2'
	|xmlns:base='http://api.vetrf.ru/schema/cdm/base'
	|xmlns:ikar='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ws:getLocalityListByRegionRequest>
	|<base:listOptions>
	|<base:count>1000</base:count>
	|<base:offset>0</base:offset>
	|</base:listOptions>
	|<ikar:regionGuid>" + guid + "</ikar:regionGuid>
	|</ws:getLocalityListByRegionRequest>
	|</soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Функция ЗагрузитьГородаПоРайону_ЗапросXML(guid) Экспорт
	
	Запрос = "<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2'
	|xmlns:base='http://api.vetrf.ru/schema/cdm/base'
	|xmlns:ikar='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ws:getLocalityListByDistrictRequest>
	|<base:listOptions>
	|<base:count>1000</base:count>
	|<base:offset>0</base:offset>
	|</base:listOptions>
	|<ikar:districtGuid>" + guid + "</ikar:districtGuid>
	|</ws:getLocalityListByDistrictRequest>
	|</soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Функция ЗагрузитьНаселенныеПунктыПоГороду_ЗапросXML(guid) Экспорт
	
	Запрос = "<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2'
	|xmlns:base='http://api.vetrf.ru/schema/cdm/base'
	|xmlns:ikar='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ws:getLocalityListByLocalityRequest>
	|<base:listOptions>
	|<base:count>1000</base:count>
	|<base:offset>0</base:offset>
	|</base:listOptions>
	|<ikar:localityGuid>" + guid + "</ikar:localityGuid>
	|</ws:getLocalityListByLocalityRequest>
	|</soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьГородаПоРегиону_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	_Регион = Параметры["Регион"];
	
	Ответ = ИнициализацияХС_ЗагрузитьГородаПоРегиону(Параметры, _Регион);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры 

Процедура ИнициализацияХС_ЗагрузитьГородаПоРайону_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Район = Параметры["Район"];
	
	Ответ = ИнициализацияХС_ЗагрузитьГородаПоРайону(Параметры, Район);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры 

Процедура ИнициализацияХС_ЗагрузитьНаселенныеПунктыПоГороду_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Город = Параметры["Город"];
	
	Ответ = ИнициализацияХС_ЗагрузитьНаселенныеПунктыПоГороду(Параметры, Город);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция ИнициализацияХС_ЗагрузитьГородаПоРегиону(Знач Параметры, _Регион) Экспорт
	
	Если НЕ ЗначениеЗаполнено(_Регион.GUID) Тогда
		ВызватьИсключение("Пустое значение Регион.GUID");
	КонецЕсли;
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetLocalityListByRegion " + _Регион + " [" + СокрЛП(_Регион.GUID) + "]");
	ЗапросXML = ЗагрузитьГородаПоРегиону_ЗапросXML(_Регион.GUID);
	Service = "platform/services/2.1/IkarService";
	Action = "GetLocalityListByRegion";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, _Регион) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// НачатьТранзакцию();
	
	Попытка
		LocalityList = xdto.Body.getLocalityListByRegionResponse.LocalityList.Locality;
		Для каждого Locality ИЗ LocalityList Цикл
			
			guid = Locality.guid;
			_uuid = Locality.uuid;
			name = Locality.view;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_Город.Ссылка КАК Ссылка,
			|	ВСД_Город.Владелец КАК Владелец
			|ИЗ
			|	Справочник.ВСД_Город КАК ВСД_Город
			|ГДЕ
			|	ВСД_Город.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", guid);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				Если НЕ ЗначениеЗаполнено(Результат.Владелец) Тогда
					Объект = Результат.Ссылка.ПолучитьОбъект();
					Объект.Владелец = _Регион.Ссылка;
					Объект.Записать();
				ИначеЕсли Результат.Владелец <> _Регион Тогда
					ВетИС_APIСервер.СообщитьИнфо("ВСД_Город [" + name + "] GUID [" + guid + "] добавлена");
					Спр = Справочники.ВСД_Город.СоздатьЭлемент();
					Спр.Наименование = name;
					Спр.Владелец = _Регион;
					Спр.GUID = guid;
					Спр.UUID = _UUID;
					Спр.Записать();
				КонецЕсли;
			Иначе
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Город [" + name + "] GUID [" + guid + "] добавлена");
				Спр = Справочники.ВСД_Город.СоздатьЭлемент();
				Спр.Наименование = name;
				Спр.Владелец = _Регион;
				Спр.GUID = guid;
				Спр.UUID = _UUID;
				Спр.Записать();
			КонецЕсли;
		КонецЦикла;
		
		// ЗафиксироватьТранзакцию();
		
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("ВСД_Город загрузка завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Город'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		// ОтменитьТранзакцию();
		
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Город " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ИнициализацияХС_ЗагрузитьГородаПоРайону(Знач Параметры, Район) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Район.GUID) Тогда
		ВызватьИсключение("Пустое значение Район.GUID");
	КонецЕсли;
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetLocalityListByDistrict " + Район + " [" + СокрЛП(Район.GUID) + "]");
	ЗапросXML = ЗагрузитьГородаПоРайону_ЗапросXML(Район.GUID);
	Service = "platform/services/2.1/IkarService";
	Action = "GetLocalityListByDistrict";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, Район) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// НачатьТранзакцию();
	Попытка
		LocalityList = xdto.Body.getLocalityListByDistrictResponse.LocalityList.Locality;
		Для каждого Locality ИЗ LocalityList Цикл
			
			guid = Locality.guid;
			_uuid = Locality.uuid;
			name = Locality.view;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_Город.Ссылка КАК Ссылка,
			|	ВСД_Город.Владелец КАК Владелец
			|ИЗ
			|	Справочник.ВСД_Город КАК ВСД_Город
			|ГДЕ
			|	ВСД_Город.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", guid);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				Если НЕ ЗначениеЗаполнено(Результат.Владелец) Тогда
					Объект = Результат.Ссылка.ПолучитьОбъект();
					Объект.Владелец = Район.Ссылка;
					Объект.Записать();
				ИначеЕсли Результат.Владелец <> Район Тогда
					Спр = Справочники.ВСД_Город.СоздатьЭлемент();
					Спр.Наименование = name;
					Спр.Владелец = Район;
					Спр.GUID = guid;
					Спр.UUID = _UUID;
					Спр.Записать();
					ВетИС_APIСервер.СообщитьИнфо("ВСД_Город [" + name + "] GUID [" + guid + "] добавлена");
				КонецЕсли;
				// Ответ = Результат.Ссылка;
			Иначе
				Спр = Справочники.ВСД_Город.СоздатьЭлемент();
				Спр.Наименование = name;
				Спр.Владелец = Район;
				Спр.GUID = guid;
				Спр.UUID = _UUID;
				Спр.Записать();
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Город [" + name + "] GUID [" + guid + "] добавлена");
				// Ответ = Спр.Ссылка;
			КонецЕсли;
		КонецЦикла;
		// ЗафиксироватьТранзакцию();
		
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("ВСД_Город загрузка завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении ВСД_Город'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		// ОтменитьТранзакцию();
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Город " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ИнициализацияХС_ЗагрузитьНаселенныеПунктыПоГороду(Знач Параметры, Город) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Город.GUID) Тогда
		ВызватьИсключение("Пустое значение Город.GUID");
	КонецЕсли;
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetLocalityListByLocality " + Город + " [" + СокрЛП(Город.GUID) + "]");
	ЗапросXML = ЗагрузитьНаселенныеПунктыПоГороду_ЗапросXML(Город.GUID);
	Service = "platform/services/2.1/IkarService";
	Action = "GetLocalityListByLocality";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, Город) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// НачатьТранзакцию();
	Попытка
		Если Число(xdto.Body.getLocalityListByLocalityResponse.localityList.count) = 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("По городу %1 в классификаторе отсутствуют прикрепленные населенные пункты", Город.Наименование);
			ВетИС_APIСервер.СообщитьИнфо(ТекстСообщения);
			Возврат Истина;
		КонецЕсли;
		
		LocalityList = xdto.Body.getLocalityListByLocalityResponse.LocalityList.Locality;
		Если ТипЗнч(LocalityList) = Тип("ОбъектXDTO") Тогда
			ДобавитьНаселенныйПункт(LocalityList, Город);
		Иначе
			Для каждого Locality ИЗ LocalityList Цикл
				ДобавитьНаселенныйПункт(Locality, Город);
			КонецЦикла;
		КонецЕсли;
		
		// ЗафиксироватьТранзакцию();
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("Загрузка населенных пунктов завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при получении населенных пунктов'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении населенных пунктов: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Процедура ДобавитьНаселенныйПункт(Locality, Город) Экспорт
	
	guid = Locality.guid;
	_uuid = Locality.uuid;
	name = Locality.view;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВСД_Город.Ссылка КАК Ссылка,
	|	ВСД_Город.Владелец КАК Владелец
	|ИЗ
	|	Справочник.ВСД_НаселенныеПункты КАК ВСД_Город
	|ГДЕ
	|	ВСД_Город.GUID = &GUID");
	Запрос.УстановитьПараметр("GUID", guid);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Если НЕ ЗначениеЗаполнено(Результат.Владелец) Тогда
			Объект = Результат.Ссылка.ПолучитьОбъект();
			Объект.Владелец = Город;
			Объект.Записать();
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Населенный пункт [" + name + "] GUID [" + guid + "] добавлена");
		Спр = Справочники.ВСД_НаселенныеПункты.СоздатьЭлемент();
		Спр.Наименование = name;
		Спр.Владелец = Город;
		Спр.GUID = guid;
		Спр.UUID = _UUID;
		Спр.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиНаселенныйПунктПоGUID(GUID, name, Город) Экспорт
	
	Ответ = Неопределено;
	Guid = СокрЛП(Guid);
	Если НЕ ПустаяСтрока(Guid) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_НаселенныеПункт.Ссылка
		|ИЗ
		|	Справочник.ВСД_НаселенныеПункты КАК ВСД_НаселенныеПункт
		|ГДЕ
		|	ВСД_НаселенныеПункт.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_НаселенныеПункт [" + name + "] GUID [" + guid + "] добавлен");
			Спр = Справочники.ВСД_НаселенныеПункты.СоздатьЭлемент();
			Спр.Наименование = name;
			Спр.GUID = guid;
			Спр.Владелец = Город;
			Спр.Записать();
			Ответ = Спр.Ссылка;
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_Город");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиРайонПоGUID(GUID, name, Регион) Экспорт
	
	Ответ = Неопределено;
	Guid = СокрЛП(Guid);
	Если НЕ ПустаяСтрока(Guid) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_Район.Ссылка
		|ИЗ
		|	Справочник.ВСД_Район КАК ВСД_Район
		|ГДЕ
		|	ВСД_Район.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_Район [" + name + "] GUID [" + guid + "] добавлен");
			Спр = Справочники.ВСД_Район.СоздатьЭлемент();
			Спр.Наименование = name;
			Спр.GUID = guid;
			Спр.Владелец = Регион;
			Спр.Записать();
			Ответ = Спр.Ссылка;
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_Район");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗагрузитьРайоны_ЗапросXML( guid ) Экспорт
	
	Запрос = "<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2'
	|xmlns:base='http://api.vetrf.ru/schema/cdm/base'
	|xmlns:ikar='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ws:getDistrictListByRegionRequest>
	|<base:listOptions>
	|<base:count>1000</base:count>
	|<base:offset>0</base:offset>
	|</base:listOptions>
	|<ikar:regionGuid>" + guid + "</ikar:regionGuid>
	|</ws:getDistrictListByRegionRequest>
	|</soapenv:Body>
	|</soapenv:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьРайоны_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	_Регион = Параметры["Регион"];
	
	Ответ = ИнициализацияХС_ЗагрузитьРайоны(Параметры, _Регион);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда 
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция ИнициализацияХС_ЗагрузитьРайоны(Знач Параметры, _Регион) Экспорт
	
	Если НЕ ЗначениеЗаполнено(_Регион.GUID) Тогда
		ВызватьИсключение("Пустое значение Регион.GUID");
	КонецЕсли;
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetDistrictListByRegion " + _Регион + " [" + СокрЛП(_Регион.GUID) + "]");
	
	ЗапросXML = ЗагрузитьРайоны_ЗапросXML(_Регион.GUID);
	Service = "platform/services/2.1/IkarService";
	Action = "GetDistrictListByRegion";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;	
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//НачатьТранзакцию();
	Попытка
		districtList = xdto.Body.getDistrictListByRegionResponse.districtList.district;
		Для Каждого district ИЗ districtList Цикл
			
			guid = district.guid;
			_uuid = district.uuid;
			name = district.view;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВСД_Район.Ссылка КАК Ссылка,
			|	ВСД_Район.Владелец КАК Владелец
			|ИЗ
			|	Справочник.ВСД_Район КАК ВСД_Район
			|ГДЕ
			|	ВСД_Район.GUID = &GUID");
			Запрос.УстановитьПараметр("GUID", guid);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда 
				Если НЕ ЗначениеЗаполнено(Результат.Владелец) Тогда
					Объект = Результат.Ссылка.ПолучитьОбъект();
					Объект.Владелец = _Регион;
					Объект.Записать();
				КонецЕсли;
			Иначе
				ВетИС_APIСервер.СообщитьИнфо("ВСД_Район [" + name + "] GUID [" + guid + "] добавлена");
				Спр = Справочники.ВСД_Район.СоздатьЭлемент();
				Спр.Наименование = name;
				Спр.GUID = guid;
				Спр.UUID = _UUID;
				Спр.Владелец = _Регион;
				Спр.Записать();
			КонецЕсли;
		КонецЦикла;
		//ЗафиксироватьТранзакцию();
		
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("ВСД_Районы загрузка завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка при получении ВСД_Район'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Район " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиУлицуПоGUID(GUID, name, НаселенныйПункт) Экспорт
	
	Ответ = Неопределено;
	Guid = СокрЛП(Guid);
	Если НЕ ПустаяСтрока(Guid) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВСД_Улица.Ссылка
		|ИЗ
		|	Справочник.ВСД_Улица КАК ВСД_Улица
		|ГДЕ
		|	ВСД_Улица.GUID = &GUID");
		Запрос.УстановитьПараметр("GUID", Guid);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда 
			Ответ = Результат.Ссылка;
		Иначе
			ВетИС_APIСервер.СообщитьИнфо("ВСД_Улица [" + name + "] GUID [" + guid + "] добавлен");
			Спр = Справочники.ВСД_Улица.СоздатьЭлемент();
			Спр.Наименование = name;
			Спр.GUID = guid;
			Спр.Владелец = НаселенныйПункт;
			Спр.Записать();
			Ответ = Спр.Ссылка;
		КонецЕсли;
	Иначе
		ВетИС_APIСервер.СообщитьИнфо("Пустой Guid ВСД_Район");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция Список_Улиц_ЗапросXML(guid, Параметры) Экспорт
	
	Запрос = "<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
	|xmlns:ws='http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2'
	|xmlns:base='http://api.vetrf.ru/schema/cdm/base'
	|xmlns:ikar='http://api.vetrf.ru/schema/cdm/dictionary/v2'>
	|<SOAP-ENV:Header/>
	|<SOAP-ENV:Body>
	|<ws:getStreetListByLocalityRequest>
	|<base:listOptions>
	|<base:count>1000</base:count>
	|<base:offset>" + Формат(Параметры["Смещение"], "ЧДЦ=0; ЧН=0; ЧГ=") + "</base:offset>
	|</base:listOptions>
	|<ikar:localityGuid>" + guid + "</ikar:localityGuid>
	|</ws:getStreetListByLocalityRequest>
	|</SOAP-ENV:Body>
	|</SOAP-ENV:Envelope>
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура ИнициализацияХС_ЗагрузитьУлицы_ВФоне(Знач Параметры, АдресХранилища) Экспорт
	
	Если Не ЗначениеЗаполнено(Параметры["НаселенныйПункт"]) И Не ЗначениеЗаполнено(Параметры["Город"])
		И ЗначениеЗаполнено(Параметры["Регион"]) Тогда
		_Город = Параметры["Регион"];
	ИначеЕсли ЗначениеЗаполнено(Параметры["НаселенныйПункт"]) Тогда
		_Город = Параметры["НаселенныйПункт"];
	ИначеЕсли ЗначениеЗаполнено(Параметры["Город"]) Тогда
		_Город = Параметры["Город"];
	Иначе
		_Город = Неопределено;
	КонецЕсли;
	
	Ответ = ИнициализацияХС_ЗагрузитьУлицы(Параметры, _Город);
	
	РезультатОбработки = Новый Структура();
	Если Ответ Тогда
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатОбработки.Вставить("ЗаданиеВыполнено", Ложь);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция ИнициализацияХС_ЗагрузитьУлицы(Знач Параметры, _Город) Экспорт
	
	Если НЕ ЗначениеЗаполнено(_Город.GUID) Тогда
		ВызватьИсключение("Пустое значение Город.GUID");
	КонецЕсли;
	
	ВетИС_APIСервер.СообщитьИнфо(" Запрос GetStreetListByLocality " + _Город + " [" + СокрЛП(_Город.GUID) + "]");
	ЗапросXML = Список_Улиц_ЗапросXML(_Город.GUID, Параметры);
	Service = "platform/services/2.1/IkarService";
	Action = "GetStreetListByLocality";
	
	ПараметрыОтправки = кб99_ВСД_Отправка.ПараметрыОтправкиИнициализация(Параметры);
	ПараметрыОтправки.ЗапросXML = ЗапросXML;
	ПараметрыОтправки.Service = Service;
	ПараметрыОтправки.Action = Action;
	xdto = кб99_ВСД_Отправка.ОтправитьSOAPНаСервере(ПараметрыОтправки);
	
	Если ВетИС_APIСервер.НайтиОшибки(xdto, _Город) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолучилиУлиц = Число(xdto.Body.GetStreetListByLocalityResponse.StreetList.count);
	//НачатьТранзакцию();
	Попытка
		
		Если ПолучилиУлиц = 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("По населенному пункту %1 в классификаторе отсутствуют улицы", _город.Наименование);
			ВетИС_APIСервер.СообщитьИнфо(ТекстСообщения);
			Возврат Истина;
		КонецЕсли;
		
		StreetList = xdto.Body.GetStreetListByLocalityResponse.StreetList.Street;
		
		Если ТипЗнч(StreetList) = Тип("ОбъектXDTO") Тогда
			ДобавитьУлицу(StreetList, _Город);
		Иначе
			Для каждого Street ИЗ StreetList Цикл
				ДобавитьУлицу(Street, _Город);
			КонецЦикла;
		КонецЕсли;
		
		//ЗафиксироватьТранзакцию();
		
		Если ПолучилиУлиц = 1000 Тогда
			Параметры["Смещение"] = Параметры["Смещение"] + 1000;
			ИнициализацияХС_ЗагрузитьУлицы(Параметры, _Город);
		КонецЕсли;
		Ответ = Истина;
		ВетИС_APIСервер.СообщитьИнфо("ВСД_Улицы загрузка завершена");
	Исключение
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка при получении ВСД_Улицы'"),
		УровеньЖурналаРегистрации.Ошибка, , ,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		//ОтменитьТранзакцию();
		Ответ = Ложь;
		ВетИС_APIСервер.СообщитьИнфо("Ошибка при получении ВСД_Улицы " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Процедура ДобавитьУлицу(Street, _Город) Экспорт
	
	guid = Street.guid;
	_uuid = Street.uuid;
	name = Street.view;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВСД_Улица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВСД_Улица КАК ВСД_Улица
	|ГДЕ
	|	ВСД_Улица.GUID = &GUID
	|	И ВСД_Улица.Владелец = &Владелец");
	Запрос.УстановитьПараметр("GUID", guid);
	Запрос.УстановитьПараметр("Владелец", _Город);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не Результат.Следующий() Тогда
		
		Спр = Справочники.ВСД_Улица.СоздатьЭлемент();
		Спр.Наименование = name;
		Спр.GUID = guid;
		Спр.UUID = _UUID;
		Спр.Владелец = _Город;
		Спр.Записать();
		ВетИС_APIСервер.СообщитьИнфо("ВСД_Улица [" + name + "] GUID [" + guid + "] добавлена");
		
	КонецЕсли;
	
КонецПроцедуры


// GRACE:MODULE_END name="ВетИС_API_АдресаСервер"
